Repository: Rudhra-balan/Microservices
Catalog: Src/Frameworks/Common.Library/ResponseHandler/Resources/ResponseMessage.*.resx
Languages: de, es, fr

# AccessViolationException
source: An attempt to access protected memory that is, to access memory that is not allocated or that is not owned by a process.
de: Ein Versuch, auf geschützten Speicher zuzugreifen, d. h. auf Speicher zuzugreifen, der nicht zugewiesen ist oder nicht im Besitz eines Prozesses ist.
es: Un intento de acceder a la memoria protegida, es decir, acceder a la memoria que no está asignada o que no es propiedad de un proceso.
fr: Tentative d'accès à la mémoire protégée, c'est-à-dire d'accès à la mémoire qui n'est pas allouée ou qui n'appartient pas à un processus.

# ArgumentException
source: A non-null argument that is passed to a method is invalid.
de: Ein Argument ungleich null, das an eine Methode übergeben wird, ist ungültig.
es: Un argumento no nulo que se pasa a un método no es válido.
fr: Un argument non nul qui est passé à une méthode n'est pas valide.

# ArgumentNull
source: An {0} argument that is passed to a method is null.
de: Ein {0} Argument, das an eine Methode übergeben wird, ist null.
es: Un {0} argumento que se pasa a un método es nulo.
fr: Un {0} argument passé à une méthode est null.

# ArgumentNullException
source: An argument that is passed to a method is null.
de: Ein Argument, das an eine Methode übergeben wird, ist null.
es: Un argumento que se pasa a un método es nulo.
fr: Un argument passé à une méthode est null.

# ArgumentOutOfRangeException
source: An argument is outside the range of valid values.
de: Ein Argument liegt außerhalb des gültigen Wertebereichs.
es: Un argumento está fuera del rango de valores válidos.
fr: Un argument est en dehors de la plage de valeurs valides.

# BadRequest
source: Invalid request or improperly formed.Please verify and try again.
de: Ungültige Anfrage oder falsch formuliert.Bitte bestätigen Sie es und versuchen Sie es erneut.
es: Solicitud no válida o formada incorrectamente. Verifique y vuelva a intentarlo.
fr: Demande invalide ou mal formée.Veuillez vérifier et réessayer.

# Conflict
source: There was a conflict between the supplied data and the existing resource.
de: Es gab einen Konflikt zwischen den bereitgestellten Daten und der vorhandenen Ressource.
es: Hubo un conflicto entre los datos proporcionados y el recurso existente.
fr: Il y avait un conflit entre les données fournies et la ressource existante.

# DirectoryNotFoundException
source: Could not find the specified directory. Please try again.
de: Das angegebene Verzeichnis konnte nicht gefunden werden. Bitte versuche es erneut.
es: No se pudo encontrar el directorio especificado. Inténtalo de nuevo.
fr: Impossible de trouver le répertoire spécifié. Veuillez réessayer.

# DivideByZeroException
source: Raised when an integer value is divide by zero.
de: Wird ausgelöst, wenn ein ganzzahliger Wert durch Null geteilt wird.
es: Aumenta cuando un valor entero se divide por cero.
fr: Levée lorsqu'une valeur entière est divisée par zéro.

# FileNotFoundException
source: A physical file does not exist at the specified location.
de: Am angegebenen Speicherort ist keine physische Datei vorhanden.
es: No existe un archivo físico en la ubicación especificada.
fr: Un fichier physique n'existe pas à l'emplacement spécifié.

# FileSharingViolation
source: An attempt to open a file that is being used by another program
de: Ein Versuch, eine Datei zu öffnen, die von einem anderen Programm verwendet wird
es: Un intento de abrir un archivo que está siendo utilizado por otro programa.
fr: Tentative d'ouverture d'un fichier utilisé par un autre programme

# Forbidden
source: Access denied you don't have permission to access. please contact system administrator.
de: Zugriff verweigert Sie haben keine Zugriffsberechtigung. Bitte wenden Sie sich an den Systemadministrator.
es: Acceso denegado, no tiene permiso para acceder. comuníquese con el administrador del sistema.
fr: Accès refusé, vous n'avez pas la permission d'accéder. veuillez contacter l'administrateur système.

# FormatException
source: A value is not in an appropriate format to be converted from a string by a conversion method such as Parse.
de: Ein Wert hat kein geeignetes Format, um von einer Konvertierungsmethode wie Parse aus einer Zeichenfolge konvertiert zu werden.
es: Un valor no tiene un formato adecuado para convertirlo de una cadena mediante un método de conversión como Parse.
fr: Une valeur n'est pas dans un format approprié pour être convertie à partir d'une chaîne par une méthode de conversion telle que Parse.

# IndexOutOfRangeException
source: An collection index is outside the lower or upper bounds of an array or collection.
de: Ein Auflistungsindex liegt außerhalb der unteren oder oberen Grenzen eines Arrays oder einer Auflistung.
es: Un índice de colección está fuera de los límites inferiores o superiores de una matriz o colección.
fr: Un index de collection est en dehors des limites inférieures ou supérieures d'un tableau ou d'une collection.

# InvalidCredentials
source: Invalid username or password. Please try again
de: Ungültiger Benutzername oder Passwort. Bitte versuche es erneut
es: Usuario o contraseña invalido. Inténtalo de nuevo
fr: Nom d'utilisateur ou mot de passe invalide. Veuillez réessayer

# InvalidOperationException
source: A method call is invalid in an object's current state.
de: Ein Methodenaufruf ist im aktuellen Zustand eines Objekts ungültig.
es: Una llamada a un método no es válida en el estado actual de un objeto.
fr: Un appel de méthode n'est pas valide dans l'état actuel d'un objet.

# InvalidPasswordException
source: Invalid Password. Please try again
de: Ungültiges Passwort. Bitte versuche es erneut.
es: Contraseña invalida. Inténtalo de nuevo
fr: Mot de passe incorrect. Veuillez réessayer.

# InvalidRefreshToken
source: Invalid Token. Please try again.
de: Ungültiges Token. Bitte versuche es erneut.
es: Simbolo no valido. Inténtalo de nuevo.
fr: Jeton invalide. Veuillez réessayer.

# InvalidRequestFormatException
source: Invalid Request Format property. Either change it, or remove the input parameters from the request.
de: Ungültige Eigenschaft für das Anforderungsformat. Ändern Sie es entweder oder entfernen Sie die Eingabeparameter aus der Anforderung.
es: Propiedad de formato de solicitud no válida. Cámbielo o elimine los parámetros de entrada de la solicitud.
fr: Propriété de format de demande non valide. Modifiez-le ou supprimez les paramètres d'entrée de la requête.

# IoException
source: The file is locked
de: Die Datei ist gesperrt
es: El archivo está bloqueado
fr: Le fichier est verrouillé

# KeyNotFoundException
source: The specified key for accessing a member in a collection cannot be found.
de: Der angegebene Schlüssel für den Zugriff auf ein Mitglied in einer Sammlung kann nicht gefunden werden.
es: No se puede encontrar la clave especificada para acceder a un miembro de una colección.
fr: La clé spécifiée pour accéder à un membre dans une collection est introuvable.

# NoContent
source: The specified URI does not contain any content.
de: Der angegebene URI enthält keinen Inhalt.
es: El URI especificado no tiene ningún contenido.
fr: L'URI spécifié ne contient aucun contenu.

# NotFound
source: The specified URI does not exist. Please verify and try again.
de: Der angegebene URI ist nicht vorhanden. Bitte überprüfen Sie und versuchen Sie es erneut.
es: El URI especificado no existe. Verifique y vuelva a intentarlo.
fr: L'URI spécifié n'existe pas. Veuillez vérifier et réessayer.

# NotImplemented
source: Server does not recognize the request method and is not capable of supporting it for any resource.
de: Der Server erkennt die Anforderungsmethode nicht und kann sie für keine Ressource unterstützen.
es: El servidor no reconoce el método de solicitud y no es capaz de admitirlo para ningún recurso.
fr: Le serveur ne reconnaît pas la méthode de demande et n'est pas capable de la prendre en charge pour aucune ressource.

# NotModified
source: The requested resource has not been modified.
de: Die angeforderte Ressource wurde nicht geändert.
es: El recurso solicitado no se ha modificado.
fr: La ressource demandée n'a pas été modifiée.

# NotSupportedException
source: A method or operation is not supported.
de: Eine Methode oder Operation wird nicht unterstützt.
es: No se admite ningún método u operación.
fr: Une méthode ou une opération n'est pas prise en charge.

# NullReferenceException
source: Access members of null object.
de: Greifen Sie auf Member des Nullobjekts zu.
es: Miembros de acceso de objeto nulo.
fr: Accéder aux membres de l'objet null.

# ObjectDisposedException
source: An operation is performed on an object that has been disposed.
de: Eine Operation wird an einem Objekt ausgeführt, das verworfen wurde.
es: Se realiza una operación sobre un objeto que ha sido eliminado.
fr: Une opération est effectuée sur un objet qui a été supprimé.

# OutOfMemoryException
source: Does not get enough memory to execute the code.
de: Erhält nicht genügend Speicher, um den Code auszuführen.
es: No tiene suficiente memoria para ejecutar el código.
fr: N'obtient pas assez de mémoire pour exécuter le code.

# OverflowException
source: An arithmetic, casting, or conversion operation results in an overflow.
de: Eine Rechen-, Casting- oder Konvertierungsoperation führt zu einem Überlauf.
es: Una operación aritmética, de conversión o de conversión da como resultado un desbordamiento.
fr: Une opération arithmétique, de transtypage ou de conversion entraîne un débordement.

# RequestIDConflictException
source: Request ID is currently in progress, Please try again later
de: Anfrage-ID wird derzeit bearbeitet. Bitte versuchen Sie es später erneut
es: La solicitud de ID está actualmente en curso. Vuelva a intentarlo más tarde.
fr: L'ID de la demande est actuellement en cours, veuillez réessayer plus tard

# RequestUriTooLong
source: The URI requested by the client is longer than the server is willing to interpret.
de: Die vom Client angeforderte URI ist länger als der Server bereit ist zu interpretieren.
es: El URI solicitado por el cliente es más largo de lo que el servidor está dispuesto a interpretar.
fr: L'URI demandé par le client est plus long que ce que le serveur est prêt à interpréter.

# RequiredFieldEmptyException
source: {0} field is required.
de: {0}-Feld ist erforderlich.
es: El campo {0} es obligatorio.
fr: Le champ {0} est obligatoire.

# RequiredFieldInvalidException
source: Invalid or unsupported {0} format.
de: Ungültiges oder nicht unterstütztes {0}-Format.
es: Formato {0} no válido o no admitido.
fr: Format {0} non valide ou non pris en charge.

# RequiredFieldMissingException
source: Required fields are missing: [{0}].
de: Erforderliche Felder fehlen: [{0}].
es: Faltan campos obligatorios: [{0}].
fr: Les champs obligatoires sont manquants : [{0}].

# RequiredNonEmptyRequestBodyException
source: A non-empty request body is required
de: Ein nicht leerer Anfragetext ist erforderlich.
es: Se requiere un cuerpo de solicitud que no esté vacío.
fr: Un corps de requête non vide est requis

# StackOverflowException
source: A stack in memory overflows.
de: Ein Stapel im Speicher läuft über.
es: Una pila en la memoria se desborda.
fr: Une pile en mémoire déborde.

# TimeoutException
source: The time interval allotted to an operation has expired.
de: Das einem Vorgang zugewiesene Zeitintervall ist abgelaufen.
es: El intervalo de tiempo asignado a una operación ha expirado.
fr: L'intervalle de temps alloué à une opération a expiré.

# TokenExpired
source: Token Expired. Please obtain a new token.
de: Token abgelaufen. Bitte besorgen Sie sich einen neuen Token.
es: Token caducado. Obtenga un nuevo token.
fr: Jeton expiré. Veuillez obtenir un nouveau jeton.

# TokenGeneratedException
source: An error occured while generating access token. Please try again.
de: Beim Generieren des Zugriffstokens ist ein Fehler aufgetreten. Bitte versuche es erneut.
es: Se produjo un error al generar el token de acceso. Inténtalo de nuevo.
fr: Une erreur s'est produite lors de la génération du jeton d'accès. Veuillez réessayer.

# UnAuthorized
source: The user is not authorized to make the request. Please try again.
de: Der Benutzer ist nicht berechtigt, die Anfrage zu stellen. Bitte versuche es erneut.
es: El usuario no está autorizado a realizar la solicitud. Inténtalo de nuevo.
fr: L'utilisateur n'est pas autorisé à faire la demande. Veuillez réessayer.

# UnauthorizedAccessException
source: Unable to access file or the file is read-only.
de: Auf die Datei kann nicht zugegriffen werden oder die Datei ist schreibgeschützt.
es: No se puede acceder al archivo o el archivo es de solo lectura.
fr: Impossible d'accéder au fichier ou le fichier est en lecture seule.

# UnknownApiError
source: Unknown API Services error has occurred. please contact system administrator.
de: Unbekannter API-Dienstfehler ist aufgetreten. Bitte wenden Sie sich an den Systemadministrator.
es: Se ha producido un error de servicios de API desconocido. comuníquese con el administrador del sistema.
fr: Une erreur de services API inconnue s'est produite. veuillez contacter l'administrateur système.

# UnsupportedMediaType
source: The media format of the requested data is not supported by the server, so the server is rejecting the request.
de: Das Medienformat der angeforderten Daten wird vom Server nicht unterstützt, daher lehnt der Server die Anforderung ab.
es: El servidor no admite el formato multimedia de los datos solicitados, por lo que el servidor rechaza la solicitud.
fr: Le format de support des données demandées n'est pas pris en charge par le serveur, le serveur rejette donc la demande.

# UriFormatException
source: An invalid uniform resource identifier (URI) is used.
de: Es wird ein ungültiger Uniform Resource Identifier (URI) verwendet.
es: Se utiliza un identificador uniforme de recursos (URI) no válido.
fr: Un identificateur de ressource uniforme (URI) non valide est utilisé.
